In [1]:
# imprort required package(pandas)

import pandas as pd
import numpy as np

In [7]:
# import Employees Data
employees = pd.read_csv('C:\\Users\\Vikas\\Downloads\\Pandas_\\Python-Pandas-Case-Study\\Pandas Case Study\\employees.csv')
employees.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,NaN,650.507.9833,21-Jun-07,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,NaN,650.507.9844,13-Jan-08,SH_CLERK,2600,-,124,50
2,200,Jennifer,Whalen,NaN,515.123.4444,17-Sep-03,AD_ASST,4400,-,101,10
3,201,Michael,Hartstein,NaN,515.123.5555,17-Feb-04,MK_MAN,13000,-,100,20
4,202,Pat,Fay,NaN,603.123.6666,17-Aug-05,MK_REP,6000,-,201,20

# Understand the data

In [9]:
employees.columns

Index(['EMPLOYEE_ID', 'FIRST_NAME', 'LAST_NAME', 'EMAIL', 'PHONE_NUMBER',
       'HIRE_DATE', 'JOB_ID', 'SALARY', 'COMMISSION_PCT', 'MANAGER_ID',
       'DEPARTMENT_ID'],
      dtype='object')

In [10]:
employees.describe

<bound method NDFrame.describe of     EMPLOYEE_ID   FIRST_NAME    LAST_NAME     EMAIL  PHONE_NUMBER  HIRE_DATE  \
0           198       Donald     OConnell       NaN  650.507.9833  21-Jun-07
1           199      Douglas        Grant       NaN  650.507.9844  13-Jan-08
2           200     Jennifer       Whalen       NaN  515.123.4444  17-Sep-03
3           201      Michael    Hartstein       NaN  515.123.5555  17-Feb-04
4           202          Pat          Fay       NaN  603.123.6666  17-Aug-05
5           203        Susan       Mavris       NaN  515.123.7777  07-Jun-02
6           204      Hermann         Baer       NaN  515.123.8888  07-Jun-02
7           205      Shelley      Higgins       NaN  515.123.8080  07-Jun-02
8           206      William        Gietz    WGIETZ  515.123.8181  07-Jun-02
9           100       Steven         King     SKING  515.123.4567  17-Jun-03
10          101        Neena      Kochhar  NKOCHHAR  515.123.4568  21-Sep-05
11          102          Lex      De Haan   LDEHAAN  515.123.4569  13-Jan-01
12          103    Alexander       Hunold   AHUNOLD  590.423.4567  03-Jan-06
13          104        Bruce        Ernst    BERNST  590.423.4568  21-May-07
14          105        David       Austin   DAUSTIN  590.423.4569  25-Jun-05
15          106        Valli    Pataballa  VPATABAL  590.423.4560  05-Feb-06
16          107        Diana      Lorentz  DLORENTZ  590.423.5567  07-Feb-07
17          108        Nancy    Greenberg  NGREENBE  515.124.4569  17-Aug-02
18          109       Daniel       Faviet   DFAVIET  515.124.4169  16-Aug-02
19          110         John         Chen     JCHEN  515.124.4269  28-Sep-05
20          111       Ismael      Sciarra  ISCIARRA  515.124.4369  30-Sep-05
21          112  Jose Manuel        Urman   JMURMAN  515.124.4469  07-Mar-06
22          113         Luis         Popp     LPOPP  515.124.4567  07-Dec-07
23          114          Den     Raphaely  DRAPHEAL  515.127.4561  07-Dec-02
24          115    Alexander         Khoo     AKHOO  515.127.4562  18-May-03
25          116       Shelli        Baida    SBAIDA  515.127.4563  24-Dec-05
26          117        Sigal       Tobias   STOBIAS  515.127.4564  24-Jul-05
27          118          Guy       Himuro   GHIMURO  515.127.4565  15-Nov-06
28          119        Karen   Colmenares  KCOLMENA  515.127.4566  10-Aug-07
29          120      Matthew        Weiss    MWEISS  650.123.1234  18-Jul-04
30          121         Adam        Fripp    AFRIPP  650.123.2234  10-Apr-05
31          122        Payam     Kaufling  PKAUFLIN  650.123.3234  01-May-03
32          123       Shanta      Vollman  SVOLLMAN  650.123.4234  10-Oct-05
33          124        Kevin      Mourgos  KMOURGOS  650.123.5234  16-Nov-07
34          125        Julia        Nayer    JNAYER  650.124.1214  16-Jul-05
35          126        Irene  Mikkilineni  IMIKKILI  650.124.1224  28-Sep-06
36          127        James       Landry   JLANDRY  650.124.1334  14-Jan-07
37          128       Steven       Markle   SMARKLE  650.124.1434  08-Mar-08
38          129        Laura       Bissot   LBISSOT  650.124.5234  20-Aug-05
39          130        Mozhe     Atkinson  MATKINSO  650.124.6234  30-Oct-05
40          131        James       Marlow   JAMRLOW  650.124.7234  16-Feb-05
41          132           TJ        Olson   TJOLSON  650.124.8234  10-Apr-07
42          133        Jason       Mallin   JMALLIN  650.127.1934  14-Jun-04
43          134      Michael       Rogers   MROGERS  650.127.1834  26-Aug-06
44          135           Ki          Gee      KGEE  650.127.1734  12-Dec-07
45          136        Hazel   Philtanker  HPHILTAN  650.127.1634  06-Feb-08
46          137       Renske       Ladwig   RLADWIG  650.121.1234  14-Jul-03
47          138      Stephen       Stiles   SSTILES  650.121.2034  26-Oct-05
48          139         John          Seo      JSEO  650.121.2019  12-Feb-06
49          140       Joshua        Patel    JPATEL  650.121.1834  06-Apr-06

        JOB_ID  SALARY COMMISSION_PCT MANAGER_ID  DEPARTMENT_ID
0     SH_CLERK    2600             -         124             50
1     SH_CLERK    2600             -         124             50
2      AD_ASST    4400             -         101             10
3       MK_MAN   13000             -         100             20
4       MK_REP    6000             -         201             20
5       HR_REP    6500             -         101             40
6       PR_REP   10000             -         101             70
7       AC_MGR   12008             -         101            110
8   AC_ACCOUNT    8300             -         205            110
9      AD_PRES   24000             -          -              90
10       AD_VP   17000             -         100             90
11       AD_VP   17000             -         100             90
12     IT_PROG    9000             -         102             60
13     IT_PROG    6000             -         103             60
14     IT_PROG    4800             -         103             60
15     IT_PROG    4800             -         103             60
16     IT_PROG    4200             -         103             60
17      FI_MGR   12008             -         101            100
18  FI_ACCOUNT    9000             -         108            100
19  FI_ACCOUNT    8200             -         108            100
20  FI_ACCOUNT    7700             -         108            100
21  FI_ACCOUNT    7800             -         108            100
22  FI_ACCOUNT    6900             -         108            100
23      PU_MAN   11000             -         100             30
24    PU_CLERK    3100             -         114             30
25    PU_CLERK    2900             -         114             30
26    PU_CLERK    2800             -         114             30
27    PU_CLERK    2600             -         114             30
28    PU_CLERK    2500             -         114             30
29      ST_MAN    8000             -         100             50
30      ST_MAN    8200             -         100             50
31      ST_MAN    7900             -         100             50
32      ST_MAN    6500             -         100             50
33      ST_MAN    5800             -         100             50
34    ST_CLERK    3200             -         120             50
35    ST_CLERK    2700             -         120             50
36    ST_CLERK    2400             -         120             50
37    ST_CLERK    2200             -         120             50
38    ST_CLERK    3300             -         121             50
39    ST_CLERK    2800             -         121             50
40    ST_CLERK    2500             -         121             50
41    ST_CLERK    2100             -         121             50
42    ST_CLERK    3300             -         122             50
43    ST_CLERK    2900             -         122             50
44    ST_CLERK    2400             -         122             50
45    ST_CLERK    2200             -         122             50
46    ST_CLERK    3600             -         123             50
47    ST_CLERK    3200             -         123             50
48    ST_CLERK    2700             -         123             50
49    ST_CLERK    2500             -         123             50  >

In [14]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EMPLOYEE_ID     50 non-null     int64
 1   FIRST_NAME      50 non-null     object
 2   LAST_NAME       50 non-null     object
 3   EMAIL           42 non-null     object
 4   PHONE_NUMBER    50 non-null     object
 5   HIRE_DATE       50 non-null     object
 6   JOB_ID          50 non-null     object
 7   SALARY          50 non-null     int64
 8   COMMISSION_PCT  50 non-null     object
 9   MANAGER_ID      50 non-null     object
 10  DEPARTMENT_ID   50 non-null     int64
dtypes: int64(3), object(8)
memory usage: 4.4+ KB

In [12]:
employees.shape

(50, 11)

In [13]:
employees.index

RangeIndex(start=0, stop=50, step=1)

In [18]:
employees.ndim

2

# Checking for missing values

In [19]:
employees.isna().sum()

EMPLOYEE_ID       0
FIRST_NAME        0
LAST_NAME         0
EMAIL             8
PHONE_NUMBER      0
HIRE_DATE         0
JOB_ID            0
SALARY            0
COMMISSION_PCT    0
MANAGER_ID        0
DEPARTMENT_ID     0
dtype: int64

In [30]:
# Check unique and duplicate values
display(employees[employees.duplicated()==False].head())
display(employees[employees.duplicated()==True])

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,NaN,650.507.9833,21-Jun-07,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,NaN,650.507.9844,13-Jan-08,SH_CLERK,2600,-,124,50
2,200,Jennifer,Whalen,NaN,515.123.4444,17-Sep-03,AD_ASST,4400,-,101,10
3,201,Michael,Hartstein,NaN,515.123.5555,17-Feb-04,MK_MAN,13000,-,100,20
4,202,Pat,Fay,NaN,603.123.6666,17-Aug-05,MK_REP,6000,-,201,20

Empty DataFrame
Columns: [EMPLOYEE_ID, FIRST_NAME, LAST_NAME, EMAIL, PHONE_NUMBER, HIRE_DATE, JOB_ID, SALARY, COMMISSION_PCT, MANAGER_ID, DEPARTMENT_ID]
Index: []

In [40]:
# Employee with greater salary than 5000
high_paid_employee = employees[employees['SALARY']>=5000]
high_paid_employee.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
3,201,Michael,Hartstein,NaN,515.123.5555,17-Feb-04,MK_MAN,13000,-,100,20
4,202,Pat,Fay,NaN,603.123.6666,17-Aug-05,MK_REP,6000,-,201,20
5,203,Susan,Mavris,NaN,515.123.7777,07-Jun-02,HR_REP,6500,-,101,40
6,204,Hermann,Baer,NaN,515.123.8888,07-Jun-02,PR_REP,10000,-,101,70
7,205,Shelley,Higgins,NaN,515.123.8080,07-Jun-02,AC_MGR,12008,-,101,110

In [43]:
# Create a new salary_value_seg which labeled according to salary values
employees['salary_value_seg'] = pd.cut(employees['SALARY'],bins=[0,5000,10000,100000], labels=['Low','Medium','High'])
employees.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,salary_value_seg
0,198,Donald,OConnell,NaN,650.507.9833,21-Jun-07,SH_CLERK,2600,-,124,50,Low
1,199,Douglas,Grant,NaN,650.507.9844,13-Jan-08,SH_CLERK,2600,-,124,50,Low
2,200,Jennifer,Whalen,NaN,515.123.4444,17-Sep-03,AD_ASST,4400,-,101,10,Low
3,201,Michael,Hartstein,NaN,515.123.5555,17-Feb-04,MK_MAN,13000,-,100,20,High
4,202,Pat,Fay,NaN,603.123.6666,17-Aug-05,MK_REP,6000,-,201,20,Medium

In [44]:
employees.groupby('salary_value_seg').count()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
salary_value_seg,,,,,,,,,,,
Low,27,27,27,24,27,27,27,27,27,27,27
Medium,16,16,16,13,16,16,16,16,16,16,16
High,7,7,7,5,7,7,7,7,7,7,7

In [72]:
#How many days between hiring and today?
import datetime
x = datetime.datetime.now()
x

datetime.datetime(2021, 2, 2, 18, 7, 18, 698544)

In [77]:
max_hiring_date = employees.HIRE_DATE.max()
print(max_hiring_date)
max_hiring_date = datetime.datetime.strptime(max_hiring_date,'%d-%b-%y')
max_hiring_date

30-Sep-05

datetime.datetime(2005, 9, 30, 0, 0)

In [84]:
difference = x-max_hiring_date
difference_in_years = (difference.days+difference.seconds/86400)/365.2425
difference_in_years

15.345298177086304

In [92]:
from dateutil.relativedelta import relativedelta
difference_in_years = relativedelta(x,max_hiring_date).years
difference_in_years

15

In [94]:
# number of employees and total salary as per department
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   EMPLOYEE_ID       50 non-null     int64
 1   FIRST_NAME        50 non-null     object
 2   LAST_NAME         50 non-null     object
 3   EMAIL             42 non-null     object
 4   PHONE_NUMBER      50 non-null     object
 5   HIRE_DATE         50 non-null     object
 6   JOB_ID            50 non-null     object
 7   SALARY            50 non-null     int64
 8   COMMISSION_PCT    50 non-null     object
 9   MANAGER_ID        50 non-null     object
 10  DEPARTMENT_ID     50 non-null     int64
 11  salary_value_seg  50 non-null     category
dtypes: category(1), int64(3), object(8)
memory usage: 4.6+ KB

In [97]:
employees.DEPARTMENT_ID.unique()

array([ 50,  10,  20,  40,  70, 110,  90,  60, 100,  30], dtype=int64)

In [99]:
employees[['DEPARTMENT_ID','EMPLOYEE_ID','SALARY']].groupby('DEPARTMENT_ID').aggregate({'EMPLOYEE_ID':'count','SALARY':sum})

               EMPLOYEE_ID  SALARY
DEPARTMENT_ID
10                       1    4400
20                       2   19000
30                       6   24900
40                       1    6500
50                      23   85600
60                       5   28800
70                       1   10000
90                       3   58000
100                      6   51608
110                      2   20308

In [ ]:
#importnt
# per_sales=Customers[['Last_region','Last_state','Last_city','Customer_Value']].groupby(['Last_region','Last_state','Last_city']).sum()
# per_sales.groupby(level=0).apply(lambda x: x/x.sum() * 100).head(10)